AzureActivity
| where (OperationNameValue == "MICROSOFT.AUTHORIZATION/POLICYASSIGNMENTS/DELETE") and (ActivityStatusValue == "Success")
    | extend Time = substring(TimeGenerated, 0, 16)
    | extend Operation = substring(OperationNameValue, -6)
| project
    Time,
    Operation,
    PolicyName = parse_json(tostring(parse_json(tostring(Properties_d.responseBody)).properties)).displayName,
    Subscription = parse_json(tostring(parse_json(tostring(Properties_d.responseBody)).properties)).scope,
    Caller
| sort by Time desc